In [2]:
import pandas as pd

### creating Series and DataFrame

In [4]:

# multiple series

user_id = pd.Series([101, 102, 103, 104, 105, 106, 107, 108])
name = pd.Series(["Amit", "Neha", "Ravi", "Priya", "Suresh", "Anita", "Rahul", "Pooja"])
age = pd.Series([24, 29, 35, 27, 42, 31, 26, 38])
gender = pd.Series(["M", "F", "M", "F", "M", "F", "M", "F"])
subscription = pd.Series(["Free", "Premium", "Premium", "Free", "Premium", "Free", "Premium", "Free"])
monthly_spend = pd.Series([0, 499, 699, 0, 999, 0, 499, 0])

In [5]:
user_id.dtype

dtype('int64')

In [6]:
gender.dtype

dtype('O')

In [7]:
gender.shape

(8,)

as it's a 1-dimensional object, so it has 8 elements in single dimension (it's not about 1-d has 1 row or 1 column).

In [32]:
type(gender)

pandas.core.series.Series

In [19]:
# creating dataframe from series

users_df = pd.DataFrame(
    {'user_id':user_id,
    'name':name,
    'age':age,
    'gender':gender,
    'subscription':subscription,
    'monthly_spend':monthly_spend })

In [21]:
users_df

   user_id    name  age gender subscription  monthly_spend
0      101    Amit   24      M         Free              0
1      102    Neha   29      F      Premium            499
2      103    Ravi   35      M      Premium            699
3      104   Priya   27      F         Free              0
4      105  Suresh   42      M      Premium            999
5      106   Anita   31      F         Free              0
6      107   Rahul   26      M      Premium            499
7      108   Pooja   38      F         Free              0

### Common and useful operations on data

In [24]:
print("shape: ", users_df.shape)

shape:  (8, 6)

In [26]:
# checking all columns names
print("columns: ", users_df.columns)

columns:  Index(['user_id', 'name', 'age', 'gender', 'subscription', 'monthly_spend'], dtype='object')

In [27]:
# info() -> gives a short summary of dataframe
users_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   user_id        8 non-null      int64
 1   name           8 non-null      object
 2   age            8 non-null      int64
 3   gender         8 non-null      object
 4   subscription   8 non-null      object
 5   monthly_spend  8 non-null      int64
dtypes: int64(3), object(3)
memory usage: 516.0+ bytes

In [28]:
# it gives a statistical summary of entire data (numerical cols as default)
users_df.describe()

         user_id        age  monthly_spend
count    8.00000   8.000000       8.000000
mean   104.50000  31.500000     337.000000
std      2.44949   6.301927     392.073608
min    101.00000  24.000000       0.000000
25%    102.75000  26.750000       0.000000
50%    104.50000  30.000000     249.500000
75%    106.25000  35.750000     549.000000
max    108.00000  42.000000     999.000000

In [29]:
# getting statistical summary of object type columns
users_df.describe(include='object')

        name gender subscription
count      8      8            8
unique     8      2            2
top     Amit      M         Free
freq       1      4            4

In [31]:
type(users_df)

pandas.core.frame.DataFrame

In [33]:
# getting top-5 records
users_df.head()

   user_id    name  age gender subscription  monthly_spend
0      101    Amit   24      M         Free              0
1      102    Neha   29      F      Premium            499
2      103    Ravi   35      M      Premium            699
3      104   Priya   27      F         Free              0
4      105  Suresh   42      M      Premium            999

In [34]:
# getting bottom 5 records
users_df.tail()

   user_id    name  age gender subscription  monthly_spend
3      104   Priya   27      F         Free              0
4      105  Suresh   42      M      Premium            999
5      106   Anita   31      F         Free              0
6      107   Rahul   26      M      Premium            499
7      108   Pooja   38      F         Free              0

In [37]:
# replacing the values
users_df.replace({'Priya':"Priyanshi"}, inplace=True)

In [43]:
users_df.name[3]

'Priyanshi'

In [42]:
print(type(users_df.name))

<class 'pandas.core.series.Series'>

In [47]:
# rename the indexes or columns
users_df.rename(columns={'monthly_spend':'spendings'}, inplace=True)

In [48]:
users_df

   user_id       name  age gender subscription  spendings
0      101       Amit   24      M         Free          0
1      102       Neha   29      F      Premium        499
2      103       Ravi   35      M      Premium        699
3      104  Priyanshi   27      F         Free          0
4      105     Suresh   42      M      Premium        999
5      106      Anita   31      F         Free          0
6      107      Rahul   26      M      Premium        499
7      108      Pooja   38      F         Free          0

In [50]:
users_df.rename(index={0:'x', 1:'y', 2:'z'}).head()

   user_id       name  age gender subscription  spendings
x      101       Amit   24      M         Free          0
y      102       Neha   29      F      Premium        499
z      103       Ravi   35      M      Premium        699
3      104  Priyanshi   27      F         Free          0
4      105     Suresh   42      M      Premium        999

In [52]:
# checking all datatypes
users_df.dtypes

user_id          int64
name            object
age              int64
gender          object
subscription    object
spendings        int64
dtype: object

In [85]:
# filtering data of specific types only
# include -> 'number' or, 'object'
users_df.select_dtypes(include='object')

        name gender subscription
0       Amit      M         Free
1       Neha      F      Premium
2       Ravi      M      Premium
3  Priyanshi      F         Free
4     Suresh      M      Premium
5      Anita      F         Free
6      Rahul      M      Premium
7      Pooja      F         Free

In [57]:
# list conversions
list(users_df.columns)
# users_df.columns.tolist()

['user_id', 'name', 'age', 'gender', 'subscription', 'spendings']

In [151]:
# checking all unique values in a series
users_df.subscription.unique()

array(['Free', 'Premium'], dtype=object)

In [214]:
# gives the count of items / records under each category of passed column
users_df.subscription.value_counts()

subscription
Free       5
Premium    4
Name: count, dtype: int64

### some important aggregation and statistical formulas

In [215]:
users_df.age.max()

42

In [154]:
users_df.age.min()

24

In [155]:
users_df.age.count()

np.int64(8)

In [156]:
users_df.age.sum()

np.int64(250)

In [157]:
users_df.age.mean()

np.float64(31.25)

In [159]:
users_df.age.median()

29.0

In [160]:
users_df.age.mode()

0    27
Name: age, dtype: int64

In [162]:
users_df.age.std()

6.453127702351562

In [163]:
users_df.age.var()

41.642857142857146

In [167]:
users_df.age.skew()

np.float64(0.6544089559963802)

In [168]:
users_df.age.kurt()

np.float64(-0.9846367490563099)

In [61]:
users_df.isna().head(2)

   user_id   name    age  gender  subscription  spendings
0    False  False  False   False         False      False
1    False  False  False   False         False      False

In [62]:
users_df.isna().sum()

user_id         0
name            0
age             0
gender          0
subscription    0
spendings       0
dtype: int64

### Filtering

selecting some or all rows (or, records) based on given conditions!

looking into the values of a given column and considering those records which are fulfilling the checks!

In [169]:
users_df[ users_df.gender=='M' ]

   user_id    name  age gender subscription  spendings
0      101    Amit   24      M         Free          0
2      103    Ravi   35      M      Premium        750
4      105  Suresh   42      M      Premium        999
6      107   Rahul   26      M      Premium        499

In [181]:
users_df[(users_df.subscription == 'Free') | (users_df.age < 30)]

   user_id       name  age gender subscription  spendings
0      101       Amit   24      M         Free          0
1      102       Neha   27      F      Premium        499
3      104  Priyanshi   27      F         Free          0
5      106      Anita   31      F         Free          0
6      107      Rahul   26      M      Premium        499
7      108      Pooja   38      F         Free          0

In [182]:
users_df[(users_df.subscription == 'Free') & (users_df.age < 30)]

   user_id       name  age gender subscription  spendings
0      101       Amit   24      M         Free          0
3      104  Priyanshi   27      F         Free          0

In [183]:
users_df[ ~(users_df.subscription == 'Free')]

   user_id    name  age gender subscription  spendings
1      102    Neha   27      F      Premium        499
2      103    Ravi   35      M      Premium        750
4      105  Suresh   42      M      Premium        999
6      107   Rahul   26      M      Premium        499

**where** method -> filters the records based on condition, and fill the invalid cells with 'NaN' or other values.

In [185]:
users_df.where( (users_df.subscription == 'Free') ).head(3)

   user_id  name   age gender subscription  spendings
0    101.0  Amit  24.0      M         Free        0.0
1      NaN   NaN   NaN    NaN          NaN        NaN
2      NaN   NaN   NaN    NaN          NaN        NaN

In [187]:
users_df.where( (users_df.subscription == 'Free'), other="Not Required" ).head(3)

,user_id,name,age,gender,subscription,spendings
0,101,Amit,24,M,Free,0
1,Not Required,Not Required,Not Required,Not Required,Not Required,Not Required
2,Not Required,Not Required,Not Required,Not Required,Not Required,Not Required

### Selecting the rows and columns

In [191]:
users_df[['name']]

        name
0       Amit
1       Neha
2       Ravi
3  Priyanshi
4     Suresh
5      Anita
6      Rahul
7      Pooja

In [70]:
type(users_df[['name']])

pandas.core.frame.DataFrame

In [72]:
type(users_df['name'])

pandas.core.series.Series

In [76]:
users_df[['name', 'age']]

        name  age
0       Amit   24
1       Neha   29
2       Ravi   35
3  Priyanshi   27
4     Suresh   42
5      Anita   31
6      Rahul   26
7      Pooja   38

In [79]:
users_df[['name', 'age']].to_numpy()

array([['Amit', 24],
       ['Neha', 29],
       ['Ravi', 35],
       ['Priyanshi', 27],
       ['Suresh', 42],
       ['Anita', 31],
       ['Rahul', 26],
       ['Pooja', 38]], dtype=object)

### selecting the rows and columns 

**using iloc vs loc**

*loc* -> integer and label based indexing!

where, the indexes and columns are labelled as integer or labels

In [108]:
users_df.loc[[1]]

   user_id  name  age gender subscription  spendings
1      102  Neha   29      F      Premium        499

In [93]:
users_df.loc[[1, 3]]

   user_id       name  age gender subscription  spendings
1      102       Neha   29      F      Premium        499
3      104  Priyanshi   27      F         Free          0

In [115]:
users_df.loc[[2,7], ['name', 'gender', 'spendings']]

    name gender  spendings
2   Ravi      M        699
7  Pooja      F          0

In [107]:
users_df.rename(index={0:'a', 2:'b'}).loc[['a', 'b', 4], ['name']]

     name
a    Amit
b    Ravi
4  Suresh

In [131]:
users_df.loc[ (users_df['age']>30)  & (users_df['gender']=='M') , ['name', 'age', 'gender'] ]

     name  age gender
2    Ravi   35      M
4  Suresh   42      M

***loc can:***

1. get single row
2. get multiple rows (list / slice)
3. get rows + columns together
4. filter using conditions
5. work with index labels and column labels

*All label-based (even if labels look like numbers).*

*iloc* -> integer based indexing!

where, indexes and columns are fetched using integers

In [110]:
users_df.iloc[[1]]

   user_id  name  age gender subscription  spendings
1      102  Neha   29      F      Premium        499

In [111]:
users_df.iloc[[1, 4]]

   user_id    name  age gender subscription  spendings
1      102    Neha   29      F      Premium        499
4      105  Suresh   42      M      Premium        999

In [120]:
users_df.iloc[[1, 4], [2,4]]

   age subscription
1   29      Premium
4   42      Premium

In [118]:
users_df.iloc[1:5, 2:4]

   age gender
1   29      F
2   35      M
3   27      F
4   42      M

***iloc can do:***

1. get single row
2. get multiple rows (list / slice)
3. get rows + columns together
4. work with row & column positions (integers)

### Add, Update, Delete records

In [192]:
# adds a new column
users_df['city'] = ['Delhi', 'Mumbai', 'Pune', 'Delhi', 'Pune', 'Delhi', 'Mumbai', 'Mumbai']

In [195]:
# adds a new record
users_df.loc[len(users_df)] = [109, 'Rajeev', 25, 'M', 'Free', 550, 'Delhi']

In [197]:
# adds a column based on values of existing column
users_df['maturity_age'] = users_df.age + 5

In [206]:
# deleting a record
ans = users_df.drop(users_df[users_df.age > 30].index)
ans

,user_id,name,age,gender,subscription,spendings,city,maturity_age
0,101,Amit,24,M,Free,0,Delhi,29
1,102,Neha,27,F,Premium,499,Mumbai,32
3,104,Priyanshi,27,F,Free,0,Delhi,32
6,107,Rahul,26,M,Premium,499,Mumbai,31
8,109,Rajeev,25,M,Free,550,Delhi,30

In [209]:
# deleting the columns
users_df.drop(columns=['maturity_age', 'city'], inplace=True)

In [210]:
users_df.columns

Index(['user_id', 'name', 'age', 'gender', 'subscription', 'spendings'], dtype='object')

In [211]:
# updating records 
users_df.loc[ users_df.name=='Ravi' , ['spendings']] = 750

In [212]:
users_df.iloc[[1], [2]] = 27